In [1]:
import pandas as pd

In [10]:
list_of_countries = [
{'Country Name':'Argentina','ISO Code':'AR','Country Population':44780677,'Country Area':'2,780,400 (1,073,500)'	,'Country Date of Independence':'9 July 1816'},
{'Country Name':'Australia','ISO Code':'AU','Country Population':25203198,'Country Area':'7,692,024 (2,969,907)'	,'Country Date of Independence':'1 January 1901'},
{'Country Name':'Bahrain','ISO Code':'BH','Country Population':	1641172	,'Country Area':'778 (300)'	,'Country Date of Independence':'15 August 1971'},
{'Country Name':'Belgium','ISO Code':'BE','Country Population':	11539328,'Country Area':'30,528 (11,787)'	,'Country Date of Independence':'4 October 1830'},
{'Country Name':'Brazil','ISO Code':'BR','Country Population':211049527,'Country Area':'8,515,767 (3,287,956)'	,'Country Date of Independence':'7 September 1822'},
{'Country Name':'Canada','ISO Code':'CA','Country Population':37411047,'Country Area':'9,984,670 (3,855,100)'	,'Country Date of Independence':'1 July 1867'},
{'Country Name':'China','ISO Code':'CN','Country Population':1433783686,'Country Area':'9,596,961 (3,705,407)'	,'Country Date of Independence':'1 October 1949'},
{'Country Name':'Denmark','ISO Code':'DK','Country Population':	5771876	,'Country Area':'43,094 (16,639)'	,'Country Date of Independence':'5 June 1849'},
{'Country Name':'Egypt','ISO Code':'EG','Country Population':100388073,'Country Area':'1,002,450 (387,050)'	,'Country Date of Independence':'28 February 1922'},
{'Country Name':'Finland','ISO Code':'FI','Country Population':5532156,'Country Area':'338,424 (130,666)'	,'Country Date of Independence':'6 December 1917'},
{'Country Name':'Germany','ISO Code':'DE','Country Population':83517045,'Country Area':'357,114 (137,882)'	,'Country Date of Independence':'18 January 1871'},
{'Country Name':'New Zealand','ISO Code':'NZ','Country Population':4783063,'Country Area':'270,467 (104,428)'	,'Country Date of Independence':'26 September 1907'},
{'Country Name':'Norway','ISO Code':'NO','Country Population':5378857,'Country Area':'385,207 (148,729)'	,'Country Date of Independence':'7 June 1905'},
{'Country Name':'South Africa','ISO Code':'ZA','Country Population':58558270,'Country Area':'1,221,037 (471,445)'	,'Country Date of Independence':'31 May 1910'},
{'Country Name':'Sri Lanka','ISO Code':'LK','Country Population':21323733,'Country Area':'65,610 (25,330)'	,'Country Date of Independence':'4 February 1948'},
{'Country Name':'Thailand','ISO Code':'TH','Country Population':69037513	,'Country Area':'513,120 (198,120)'},
{'Country Name':'Turkey','ISO Code':'TR','Country Population':	83429615	,'Country Area':'783,562 (302,535)'	,'Country Date of Independence':'29 October 1923'},
{'Country Name':'United Kingdom','ISO Code':'GB','Country Population':	67530172	,'Country Area':'242,495 (93,628)'},
{'Country Name':'United States','ISO Code':'US','Country Population':	329064917	,'Country Area':'9,525,067 (3,677,649)'	,'Country Date of Independence':'4 July 1776'},
{'Country Name':'Vietnam','ISO Code':'VN','Country Population':	96462106	,'Country Area':'331,212 (127,882)'	,'Country Date of Independence':'2 September 1945'}]

In [3]:
import pandas as pd

list_of_countries = [
{'Country Name':'China','ISO Code':'CN','Country Population':1433783686,'Country Area km2 (mi2)':'9,596,961 (3,705,407)','Country Date of Independence':'1 October 1949'},
{'Country Name':'New Zealand','ISO Code':'NZ','Country Population':4783063,'Country Area km2 (mi2)':'270,467 (104,428)','Country Date of Independence':'26 September 1907'},
{'Country Name':'South Africa','ISO Code':'ZA','Country Population':58558270,'Country Area km2 (mi2)':'1,221,037 (471,445)','Country Date of Independence':'31 May 1910'},
{'Country Name':'United Kingdom','ISO Code':'GB','Country Population':67530172,'Country Area km2 (mi2)':'242,495 (93,628)'},
{'Country Name':'United States','ISO Code':'US','Country Population':329064917,'Country Area km2 (mi2)':'9,525,067 (3,677,649)','Country Date of Independence':'4 July 1776'},]

countries = pd.DataFrame(list_of_countries)

In [4]:
countries

,Country Name,ISO Code,Country Population,Country Area km2 (mi2),Country Date of Independence
0,China,CN,1433783686,"9,596,961 (3,705,407)",1 October 1949
1,New Zealand,NZ,4783063,"270,467 (104,428)",26 September 1907
2,South Africa,ZA,58558270,"1,221,037 (471,445)",31 May 1910
3,United Kingdom,GB,67530172,"242,495 (93,628)",NaN
4,United States,US,329064917,"9,525,067 (3,677,649)",4 July 1776

In [4]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Country Name                  6 non-null      object
 1   ISO Code                      6 non-null      object
 2   Country Population            6 non-null      int64
 3   Country Area km2 (mi2)        6 non-null      object
 4   Country Date of Independence  5 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [5]:
countries.columns

Index(['Country Name', 'ISO Code', 'Country Population',
       'Country Area km2 (mi2)', 'Country Date of Independence'],
      dtype='object')

In [6]:
countries['Country Area km2 (mi2)'].str.split(' ', expand = True)

           0            1
0  9,596,961  (3,705,407)
1    270,467    (104,428)
2  1,221,037    (471,445)
3    242,495     (93,628)
4  9,525,067  (3,677,649)
5    270,467    (104,428)

In [7]:
countries[['Area km2','Area mi2']] = countries['Country Area km2 (mi2)'].str.split(' ', expand = True)

In [10]:
countries

,Country Name,ISO Code,Country Population,Country Area km2 (mi2),Country Date of Independence,Area km2,Area mi2
0,China,CN,1433783686,"9,596,961 (3,705,407)",1 October 1949,9596961,3705407
1,New Zealand,NZ,4783063,"270,467 (104,428)",26 September 1907,270467,104428
2,South Africa,ZA,58558270,"1,221,037 (471,445)",31 May 1910,1221037,471445
3,United Kingdom,GB,67530172,"242,495 (93,628)",NaN,242495,93628
4,United States,US,329064917,"9,525,067 (3,677,649)",4 July 1776,9525067,3677649
5,New Zealand,NZ,4783063,"270,467 (104,428)",26 September 1907,270467,104428

In [9]:
countries['Area km2'] = countries['Area km2'].str.replace('(\D+)','')
countries['Area mi2'] = countries['Area mi2'].str.replace('(\D+)','')

In [11]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Country Name                  6 non-null      object
 1   ISO Code                      6 non-null      object
 2   Country Population            6 non-null      int64
 3   Country Area km2 (mi2)        6 non-null      object
 4   Country Date of Independence  5 non-null      object
 5   Area km2                      6 non-null      object
 6   Area mi2                      6 non-null      object
dtypes: int64(1), object(6)
memory usage: 464.0+ bytes

In [12]:
countries.rename(columns={'Country Name': 'country_name', 'ISO Code': 'country_code',
                          'Country Population': 'country_population', 'Country Date of Independence': 'independence_date',
                          'Area km2': 'area_km2', 'Area mi2': 'area_mi2'}, inplace=True)

In [13]:
countries.drop(columns=['Country Area km2 (mi2)'], inplace = True)

In [18]:
countries = countries.astype({'area_km2': 'int64', 'area_mi2':'int64', 'independence_date':'datetime64'})

In [20]:
countries.drop_duplicates(inplace = True)

In [21]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   country_name        5 non-null      object
 1   country_code        5 non-null      object
 2   country_population  5 non-null      int64
 3   independence_date   4 non-null      datetime64[ns]
 4   area_km2            5 non-null      int64
 5   area_mi2            5 non-null      int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 280.0+ bytes

In [22]:
countries

,country_name,country_code,country_population,independence_date,area_km2,area_mi2
0,China,CN,1433783686,1949-10-01,9596961,3705407
1,New Zealand,NZ,4783063,1907-09-26,270467,104428
2,South Africa,ZA,58558270,1910-05-31,1221037,471445
3,United Kingdom,GB,67530172,NaT,242495,93628
4,United States,US,329064917,1776-07-04,9525067,3677649